"use client";

import type { ComponentProps } from "react";

import autoplay from "embla-carousel-autoplay";
import useEmblaCarousel from "embla-carousel-react";

import CommentCard from "./comment";

const comments: ComponentProps<typeof CommentCard>[] = [
  {
    content:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طن که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و Velit exercitation sit commodo nostrud deserunt laborum velit ex reprehenderit ut labore eu.ن که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و Velit exercitation sit commodo nostrud deserunt laborum velit ex reprehenderit ut labore eu.ن که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و Velit exercitation sit commodo nostrud deserunt laborum velit ex reprehenderit ut labore eu.راحان رایانه ای علی الخصوص طراحان خلاقی، و Velit exercitation sit commodo nostrud deserunt laborum velit ex reprehenderit ut labore eu.",
    id: "6a5d5846-3831-40a5-bedd-ced6f5d72a34",
    author: { name: "میلاد حسیبی" },
  },
  {
    content:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و ",
    id: "6a5d5846-3831-40a5s-bedd-ced6f5d72a34",
    author: { name: "میلاد حسیبی" },
  },
  {
    content:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طن که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و Velit exercitation sit commodo nostrud deserunt laborum velit ex reprehenderit ut labore eu.ن که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و Velit exercitation sit commodo nostrud deserunt laborum velit ex reprehenderit ut labore eu.ن که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و Velit exercitation sit commodo nostrud deserunt laborum velit ex reprehenderit ut labore eu.راحان رایانه ای علی الخصوص طراحان خلاقی، و Velit exercitation sit commodo nostrud deserunt laborum velit ex reprehenderit ut labore eu.",
    id: "6a5d5846-3fasdf831-40a5-bedd-ced6f5d72a34",
    author: { name: "میلاد حسیبی" },
  },
  {
    content:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و ",
    id: "6a5d5846-3831-40a5-abedd-ced6f5d72a34",
    author: { name: "میلاد حسیبی" },
  },
  {
    content:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و ",
    id: "6a5d5846-3831-40a5-bedd-ced6f5hd72a34",
    author: { name: "میلاد حسیبی" },
  },
];

const CommentCarusel = () => {
  const [emblaRef] = useEmblaCarousel(
    {
      axis: "y",
      duration: 10,
      align: "start",
      slidesToScroll: 1,
    },
    [
      autoplay({
        stopOnInteraction: false,
        stopOnMouseEnter: true,
      }),
    ],
  );
  return (
    <div className="w-full h-[60svh]">
      <div className="overflow-hidden h-[60svh] rounded-lg" ref={emblaRef}>
        <div className="flex flex-col h-full items-start transition-all">
          {comments.map((comment) => (
            <div className="p-8 select-none" key={comment.id}>
              <CommentCard {...comment} />
            </div>
          ))}
        </div>
      </div>
    </div>
  );
};

export default CommentCarusel;
